xml4test/examples.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"><S:Body><ns2:SendRequestRequest><ns:SenderProvidedRequestData xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1" Id="SIGNED_BY_CONSUMER"><ns:MessageID>000</ns:MessageID><ns2:MessagePrimaryContent><ns1:FNSVipIPRequest xmlns:ns1="urn://x-artefacts-fns-vipip-tosmv-ru/311-15/4.0.5" ИдДок="754E9D4C-FF7A-4EBC-B047-944D7039E193" НомерДела="47E6FD69-255E-4119-8E5B-929FD065ACF5"><ns1:ЗапросИП><ns1:ИНН>772770224286</ns1:ИНН></ns1:ЗапросИП></ns1:FNSVipIPRequest></ns2:MessagePrimaryContent><ns:TestMessage/></ns:SenderProvidedRequestData><ns4:CallerInformationSystemSignature xmlns:ns4="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:Signature><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#SIGNED_BY_CONSUME_R"><ds:Transforms><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>000</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>000</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>000</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns4:CallerInformationSystemSignature></ns2:SendRequestRequest></S:Body></S:Envelope>







<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"><S:Body><ns2:SendRequestRequest><ns:SenderProvidedRequestData xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1" Id="SIGNED_BY_CONSUMER"><ns:MessageID>000</ns:MessageID><ns2:MessagePrimaryContent><req:ImportPaymentsRequest xmlns:com="http://roskazna.ru/gisgmp/xsd/Common/2.0.1" xmlns:req="urn://roskazna.ru/gisgmp/xsd/services/import-payments/2.0.1" xmlns:pmnt="http://roskazna.ru/gisgmp/xsd/Payment/2.0.1" xmlns:rfd="http://roskazna.ru/gisgmp/xsd/Refund/2.0.1" xmlns:chg="http://roskazna.ru/gisgmp/xsd/Charge/2.0.1" xmlns:org="http://roskazna.ru/gisgmp/xsd/Organization/2.0.1" xmlns:bdi="http://roskazna.ru/gisgmp/xsd/BudgetIndex/2.0.1" xmlns:pkg="http://roskazna.ru/gisgmp/xsd/Package/2.0.1" Id="PERSONAL_SIGNATU___RE" senderIdentifier="3637c9" senderRole="9" timestamp="2018-08-02T08:45:18.8228099+04:00"><pkg:PaymentsPackage><pkg:ImportedPayment Id="I_F1C7A365-E659-4D6D-8251-C7F96C490789" paymentId="10412037291011180108201819727139" purpose="Арендная плата по договору аренды имущества N 12378 от 19.08.2011 г. за август 2018г." kbk="70611105034040001120" oktmo="12701000" supplierBillID="0" amount="142527" paymentDate="2018-08-01" transKind="01"><pmnt:PaymentOrg><org:Bank bik="041203729" name="АО ВКАБАНК" correspondentBankAccount="30101810700000000729"/></pmnt:PaymentOrg><pmnt:Payer payerIdentifier="1010000000001202496955"/><org:Payee name="УФК по Астраханской области (Управление муниципального имущества администрации муниципального образования &quot;Город Астрахань&quot;, л/с 04253393400)" inn="3015090933" kpp="301501001"><com:OrgAccount accountNumber="40101810400000010009"><com:Bank bik="041203001"/></com:OrgAccount></org:Payee><pmnt:BudgetIndex status="24" paytReason="0" taxPeriod="0" taxDocNumber="01;1202496955" taxDocDate="0"/><pmnt:AccDoc accDocDate="2018-08-01"/><com:ChangeStatus meaning="1"/><com:AdditionalData><com:Name>Плательщик</com:Name><com:Value>Савченко Наталья Васильевна, г. Астрахань, ул. Сен-симона, д.5, кв.6</com:Value></com:AdditionalData></pkg:ImportedPayment></pkg:PaymentsPackage></req:ImportPaymentsRequest></ns2:MessagePrimaryContent><ns:PersonalSignature><ds:Signature xmlns:ns4="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#PERSONAL_SIGNATURE"><ds:Transforms><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>000</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>000</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>000</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns:PersonalSignature><ns:TestMessage/></ns:SenderProvidedRequestData><ns4:CallerInformationSystemSignature xmlns:ns4="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:Signature><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#SIGNED_BY_CONSUMER"><ds:Transforms><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>000</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>000</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>000</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns4:CallerInformationSystemSignature></ns2:SendRequestRequest></S:Body></S:Envelope>






<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"><S:Body><ns2:SendRequestRequest><ns:SenderProvidedRequestData xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1" Id="SIGNED_BY_CONSUMER"><ns:MessageID>000</ns:MessageID><ns2:MessagePrimaryContent><ns:request xmlns:ns="urn://ru/mvd/sovm/p001/1.0.0"><ns:requestInfo><ns:passportRFSeries>2479</ns:passportRFSeries><ns:passportRFNumber>674804</ns:passportRFNumber></ns:requestInfo></ns:request></ns2:MessagePrimaryContent><ns:TestMessage/></ns:SenderProvidedRequestData><ns3:CallerInformationSystemSignature xmlns:ns4="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:Signature><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#SIGNED_BY_CONSUMER"><ds:Transforms><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>000</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>000</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>000</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns4:CallerInformationSystemSignature></ns2:SendRequestRequest></S:Body></S:Envelope>













